// Copyright 2018 Shestakov Denis. All rights reserved.
// Use of this source code is governed by a Lil
// license that can be found in the LICENSE file.

package err

import (
	"net/http"
)

// Список кодов ошибок. Коды формируются по следующему правилу:
// Код - число из 7 разрядов вида AABCCDD
// AA - модуль (место) возникновения (и подмодуль, если есть)
//      1х - Глобальные и/или системные функции
//      2х - Модуль конфигурации
//      3х - Модуль работы с БД (общие функции)
//          30 - Общие функции
//          31 - PostgreSQL
//          32 - MongoDB
//      ...
//      9х - Специальные коды для unit-тестов
// B - Номер версии соответствующего класса
// СС - тип ошибки по причине возникновения (в т.ч. по подгруппам)
//      0х - Непредвиденная ошибка (ошибка кода)
//      1х - Ошибка в данных пользователя
//          10 - Причина некорректности неизвестна
//          11 - Некорректный тип данных
//      ...
// DD - конкретный код ошибки по типу
//      00 - Неизвестная ошибка
const (
	UNKNOWN = 1010000

	TST_ERR = 9010000
	MAX_ERR = 9999999
)

// Словарь параметров ошибок по кодам. Для сокращения записи и исключения ошибок
// В текстах шаблонов можно (и нужно) использовать подстановки
var tpl_v1 = map[int]ErrV1{
	UNKNOWN: ErrV1{Status: http.StatusInternalServerError, Message: "Неизвестная ошибка"},
	TST_ERR: ErrV1{Status: http.StatusBadRequest, Message: "Тестовое сообщение: '%s'"},
}
